Gets a copy of the section box for this 3D view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public BoundingBoxXYZ GetSectionBox()
  Visual Basic
Public Function GetSectionBox As BoundingBoxXYZ
  Visual C++
public:
BoundingBoxXYZ^ GetSectionBox()
 Return Value
 The section box. Note that the section box can be rotated and transformed and thus you will need to use  Transform  to interpret the coordinates of the corners or sides of the box in model coordinates.
 Remarks
 The section box cuts the model in this view by its boundaries.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   View cannot be a template view.
 See Also
  View3D Class
  Autodesk.Revit.DB Namespace